{
  "architectures": [
    "NewModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auto_map": {
    "AutoConfig": "configuration.NewConfig",
    "AutoModel": "modeling.NewModel",
    "AutoModelForMaskedLM": "modeling.NewForMaskedLM",
    "AutoModelForMultipleChoice": "modeling.NewForMultipleChoice",
    "AutoModelForQuestionAnswering": "modeling.NewForQuestionAnswering",
    "AutoModelForSequenceClassification": "modeling.NewForSequenceClassification",
    "AutoModelForTokenClassification": "modeling.NewForTokenClassification"
  },
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-6,
  "layer_norm_type": "rms_norm",
  "max_position_embeddings": 32768,
  "model_type": "new",
  "num_attention_heads": 16,
  "num_kv_heads": 4,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "position_embedding_type": "rope",
  "pooling_type": "mean",
  "num_latents": 1,
  "rope_scaling": {
    "type": "yarn",
    "factor": 4.0,
    "original_max_position_embeddings": 8192
  },
  "rope_theta": 160000,
  "torch_dtype": "float32",
  "type_vocab_size": 2,
  "unpad_inputs": false,
  "use_memory_efficient_attention": false,
  "vocab_size": 30528
}
